## Big Data Mining
### Project 2
### 2019-2020

Kyriakos   Zormpas  
Alexandros Zotos  
Theodora  Koutsothanasi  
Evangelia Santorinaiou  dsc19024

## Libraries

In [23]:
#!pip install namegenerator

In [3]:
import pandas as pd
import numpy as np

import namegenerator
from datetime import datetime, timedelta
import random
import time
import names

# Dataset Creation

Our scenario in order to build our dataset is that we have the restaurants from all over the world, name, id, when they were founded and their age, their coordinates, their speciality and their reviews.

In [4]:
def str_time_prop(start, end, format, prop):
    """Get a time at a proportion of a range of two formatted times.

    start and end should be strings specifying times formated in the
    given format (strftime-style), giving an interval [start, end].
    prop specifies how a proportion of the interval to be taken after
    start.  The returned time will be in the specified format.
    """

    stime = time.mktime(time.strptime(start, format))
    etime = time.mktime(time.strptime(end, format))

    ptime = stime + prop * (etime - stime)

    return time.strftime(format, time.localtime(ptime))

def random_date(start, end, prop):
    return str_time_prop(start, end, '%m/%d/%Y', prop)

To find the random latitude and longitude we used worldcitiespop.csv and we kept the country and the city that match each combination. We did not use AccentCity column because it is the same with City but with accents thus it not provides additional information. Also we removed Population because most of the values were Nan and Region because we will not use it in our scenario.

In [136]:
def get_latitude_longititude(df_lat):
    df_lat = pd.read_csv('worldcitiespop.csv')[:30000]
    df_lat = df_lat.loc[:,['Country', 'City', 'Latitude', 'Longitude']]

In [137]:
get_latitude_longititude(df_lat)
df_lat.head(5)

  Country        City   Latitude  Longitude
0      ad       aixas  42.483333   1.466667
1      ad  aixirivali  42.466667   1.500000
2      ad  aixirivall  42.466667   1.500000
3      ad   aixirvall  42.466667   1.500000
4      ad    aixovall  42.466667   1.483333

### Restaurants

In [97]:
restaurant_df = pd.DataFrame(columns=['id', 'name', 'cid', 'sid', 'founded', 'age'])


for i in range(df_lat.shape[0]):
    r_date = random_date("01/01/2008", "12/31/2019", random.random())
    
    restaurant_df.loc[i] = [np.random.randint(100000, 999999), 
                            namegenerator.gen(), 
                            np.random.randint(10000, 99999), 
                            np.random.randint(100000, 999999),  
                            r_date, 
                            int(str(datetime.today())[:4]) - int(r_date[6:])]
restaurant_df.head(5)

       id                   name    cid     sid     founded age
0  828837   gamy-eggplant-birman  62818  815255  06/04/2010   9
1  723295  wimpy-cerise-flamingo  82874  652943  11/24/2015   4
2  194132   gloppy-chocolate-ray  62762  810891  10/13/2011   8
3  203253      gamy-green-beetle  12878  115094  09/11/2016   3
4  305109    stealthy-teal-tapir  59628  174951  03/25/2008  11

### Coordinates

In [132]:
coordinates_df = pd.DataFrame(columns = ['id', 'latitude', 'longitude', 'city', 'country_code'])

coordinates_df['id'] = restaurant_df['cid']
coordinates_df['latitude'] = df_lat['Latitude']
coordinates_df['longitude'] = df_lat['Longitude']
coordinates_df['city'] = df_lat['City']
coordinates_df['country_code'] = df_lat['Country']

coordinates_df.head(5)

/home/eva/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3249: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):

      id   latitude  longitude        city country_code
0  62818  42.483333   1.466667       aixas           ad
1  82874  42.466667   1.500000  aixirivali           ad
2  62762  42.466667   1.500000  aixirivall           ad
3  12878  42.466667   1.500000   aixirvall           ad
4  59628  42.466667   1.483333    aixovall           ad

### Speciality

In [109]:
speciality_df = pd.DataFrame(columns = [ 'id', 'name', 'calories', 'price', 'cuisine_name', 'is_vegan', 
                                        'is_gluten_free', 'is_lactose_free'])

speciality_names = [line.strip() for line in open("specialityNames.txt", 'r', encoding="utf8")]
cuisine_names = [line.strip() for line in open("cuisineNames.txt", 'r', encoding="utf8")]

speciality_df['id'] = restaurant_df['sid']
for i in range(restaurant_df.shape[0]):
    speciality_df.loc[i]['name'] = random.choice(speciality_names)
    speciality_df.loc[i]['calories'] = random.randrange(50, 1000)
    speciality_df.loc[i]['price'] = random.randrange(1, 500)
    speciality_df.loc[i]['cuisine_name'] = random.choice(cuisine_names) 
    speciality_df.loc[i]['is_vegan'] = random.randrange(100) < 25
    speciality_df.loc[i]['is_gluten_free'] =  random.randrange(100) < 15
    speciality_df.loc[i]['is_lactose_free'] = random.randrange(100) < 15

In [111]:
speciality_df.head(5)

,id,name,calories,price,cuisine_name,is_vegan,is_gluten_free,is_lactose_free
0,815255,"Veal Cutlet, Milanaise",821,394,Lebanese,False,False,True
1,652943,Whipped Cream Puffs,751,484,Chinese Islamic,True,False,False
2,810891,"""Rijs Itaafel"": Rice, Curry Sauce, Lobster, Sh...",282,73,Yamal,False,False,False
3,115094,"Prime Sirloin Steak, Maison Sandwich",342,479,Maharashtrian,False,False,False
4,174951,"An Inattention on Part of Waitress, Please Rep...",920,318,Taiwanese,False,False,False

### Reviews

In [105]:
reviews_df = pd.DataFrame(columns=['id', 'rid', 'first_Name','last_Name','rating'])

reviews_num = restaurant_df.shape[0] * 3
for i in range(reviews_num): 
    
    reviews_df.loc[i] = [np.random.randint(100000, 999999), 
                         restaurant_df['id'][random.randrange(restaurant_df.shape[0])],
                         names.get_first_name(),names.get_last_name(), np.random.randint(1,5)]

reviews_df.head(5)

       id     rid first_Name  last_Name rating
0  801443  493079      Carol  Henderson      1
1  278425  932382    Pauline  Tarnowski      4
2  595869  598850     Weston     Wilson      3
3  367615  693787  Stephanie     Doctor      1
4  943894  977072       Dana    Maretti      1

# Add Noise

* One case we thought for noise is that some restaurants either do not have specility dish or their speciality is missing. Thus we changed some ids from speciality so that sid from restaurants and id from speciality do not match.

In [113]:
def noise_gen(df, nn, range_, col):
    
    for i in range(nn):
        df.loc[np.random.randint(0, df.shape[0]-1)][col] = np.random.randint(range_[0], range_[1])

In [114]:
noise_gen(restaurant_df, int(restaurant_df.shape[0] * 1/100), (1000, 9000), 'id')
restaurant_df.head(5)

       id                   name    cid     sid     founded age
0  828837   gamy-eggplant-birman  62818  815255  06/04/2010   9
1  723295  wimpy-cerise-flamingo  82874  652943  11/24/2015   4
2  194132   gloppy-chocolate-ray  62762  810891  10/13/2011   8
3  203253      gamy-green-beetle  12878  115094  09/11/2016   3
4  305109    stealthy-teal-tapir  59628  174951  03/25/2008  11

* Review table contains values out of range 1-5.

In [129]:
noise_gen(reviews_df, int(reviews_df.shape[0] * 1/10), (-2, 0), 'rating')
noise_gen(reviews_df, int(reviews_df.shape[0] * 1/10), (6, 10), 'rating')
reviews_df.head(20)

        id     rid first_Name   last_Name rating
0   801443  493079      Carol   Henderson      1
1   278425  932382    Pauline   Tarnowski      4
2   595869  598850     Weston      Wilson      3
3   367615  693787  Stephanie      Doctor      1
4   943894  977072       Dana     Maretti      9
5   625836  335049      Kerry        Aten      2
6   882939  935095       June  Richardson      4
7   837223  300015       Jody      Howard      1
8   961026  246538      Irvin     Jackson      2
9   708525  755012       Zane      Murphy      7
10  585653  156498    Sherman   Mcgonagle      2
11  954393  790615     Gladys     Calhoun     -2
12  645312  486104   Virginia      Damato      2
13  826987  509442     Evelyn      Dunkel     -2
14  121825  738485    Douglas     Schmidt      1
15  149811  718166      David  Montgomery      3
16  568400  358148     Arthur       Ikeda     -2
17  100131  897778      James        Pyne      2
18  851078  655237      Ralph       Myers      1
19  263014  941620   Nicholas    Thompson      3

* Mismatch in restaurant table between founded year and its age.

In [118]:
errors = 100
for i in range(errors):
    # throw a random number to use as index of the df
    pos = np.random.randint(0, len(restaurant_df))
    if pos%2:
        restaurant_df.loc[pos, 'age'] -= 2
    else:
        restaurant_df.loc[pos, 'age'] += 2

In [119]:
restaurant_df.head(5)

       id                   name    cid     sid     founded age
0  828837   gamy-eggplant-birman  62818  815255  06/04/2010   9
1  723295  wimpy-cerise-flamingo  82874  652943  11/24/2015   4
2  194132   gloppy-chocolate-ray  62762  810891  10/13/2011   8
3  203253      gamy-green-beetle  12878  115094  09/11/2016   3
4  305109    stealthy-teal-tapir  59628  174951  03/25/2008  11

* Null values insertion in random places in each dataframe

In [120]:
def add_missing_values(df, number, col=None):
    df_cols = list(df.columns)
    col_idx = col
    for i in range(number):
        pos = np.random.randint(0, len(df))
        if col == None:
            # mess up the whole dataframe randomly
            col_idx = df_cols[np.random.randint(2, len(df_cols))]

        df.loc[pos, col_idx] = None

In [133]:
null_rest  = int(1000)
null_coord = int(0.1 / coordinates_df.shape[0])
null_spec  = int(0.1 / speciality_df.shape[0])
null_rev   = int(0.1 / restaurant_df.shape[0])

add_missing_values(restaurant_df, null_rest)
add_missing_values(coordinates_df,null_coord)
add_missing_values(speciality_df, null_spec)
add_missing_values(reviews_df,    null_rev)

In [134]:
coordinates_df

          id   latitude  longitude                city country_code
0      62818  42.483333   1.466667               aixas           ad
1      82874  42.466667   1.500000          aixirivali           ad
2      62762  42.466667   1.500000          aixirivall           ad
3      12878  42.466667   1.500000           aixirvall           ad
4      59628  42.466667   1.483333            aixovall           ad
5      22810  42.500000   1.516667             andorra           ad
6      66886  42.500000   1.516667    andorra la vella           ad
7      48892  42.500000   1.516667     andorra-vieille           ad
8      74728  42.500000   1.516667             andorre           ad
9      33179  42.500000   1.516667  andorre-la-vieille           ad
10     50534  42.500000   1.516667     andorre-vieille           ad
11     76942  42.566667   1.516667           ansalonga           ad
12     70928  42.533333   1.533333               anyos           ad
13     54373  42.583333   1.516667               arans           ad
14     71548  42.566667   1.483333             arinsal           ad
15     75309  42.450000   1.500000             aubinya           ad
16     64880  42.450000   1.500000             auvinya           ad
17     76574  42.483333   1.466667           bicisarri           ad
18     65677  42.483333   1.466667          bixessarri           ad
19     29907  42.483333   1.466667           bixisarri           ad
20     30591  42.566667   1.600000             canillo           ad
21     68855  42.533333   1.566667          casas vila           ad
22     39153  42.466667   1.500000             certers           ad
23     84823  42.466667   1.500000              certes           ad
24      None  42.466667   1.500000          eixirivall           ad
25     16545  42.550000   1.516667              el pui           ad
26     11783  42.533333   1.583333            els bons           ad
27     21056  42.616667   1.550000           el serrat           ad
28     34473  42.583333   1.633333           els plans           ad
29     89081  42.583333   1.650000           el tarter           ad
...      ...        ...        ...                 ...          ...
29970  10048  34.217500  69.343611         hoseyn khel           af
29971  84070  36.024817  68.674400        hoseyn kheyl           af
29972  20482  33.425278  68.309444        hoseyn kheyl           af
29973  36404  33.293617  61.905907        hoseyn kheyl           af
29974  23804  34.487583  69.300066        hoseyn kheyl           af
29975  80617  34.565443  69.724316         hoseynkheyl           af
29976  44032  34.217500  69.343611         hoseynkheyl           af
29977  15553  36.641586  69.092651        hoseyn kheyl           af
29978  98038  33.555103  69.072815        hoseyn kheyl           af
29979  33467  32.942567  68.519919          hoseyn kur           af
29980  51580  31.232945  62.161461        hoseyn `omar           af
29981  59334  31.174668  66.349761          hoseynza'i           af
29982  38631  31.101008  66.381801           hoseynzay           af
29983  68505  31.287493  66.426075            hoseynzi           af
29984  58884  32.644974  67.692846       hotake `illya           af
29985  56213  32.640683  67.686796       hotak-e sufla           af
29986  52799  32.640683  67.686796        hotake sufla           af
29987  24578  32.644974  67.692846       hotak-e `ulya           af
29988   None  34.118340  63.661217            hotak ha           af
29989  41648  31.565028  66.992318               hotak           af
29990  99023  32.407667  67.542697               hotak           af
29991  94773  35.899414  64.378364              hotaki           af
29992  18515  36.723936  66.590896              hotaki           af
29993  55918  31.620448  65.053692               hotal           af
29994  24862  32.073068  67.950136        hoteko kalay           af
29995  16621  32.073068  67.950136        hoteko kelay           af
29996  23278  32.640683  67.686796         hotke sufla           af
29997  74745  34.457286  62.291670          howa dasht           af
29998  65140  33.766394  65.938010             howarak           af
29999  88753  36.922089  69.388374           howar say           af

[30000 rows x 5 columns]

In [124]:
restaurant_df.head(30)

        id                        name    cid     sid     founded age
0   828837        gamy-eggplant-birman  62818  815255  06/04/2010   9
1   723295       wimpy-cerise-flamingo  82874  652943  11/24/2015   4
2   194132        gloppy-chocolate-ray  62762  810891  10/13/2011   8
3   203253           gamy-green-beetle  12878  115094  09/11/2016   3
4   305109         stealthy-teal-tapir  59628  174951  03/25/2008  11
5   934891  cheeky-aquamarine-reindeer  22810  793055  04/01/2016   3
6   881407   shaggy-lavender-alligator  66886  236874  02/01/2011   8
7   883231    sleazy-magenta-armadillo  48892  373104  07/19/2011   8
8   563774     foggy-malachite-catfish  74728  293322  09/15/2008  11
9   448930   squeaky-pumpkin-albatross  33179  563530  03/05/2010   9
10  550190        snappy-harlequin-fox  50534  561408  10/16/2011   8
11  223549   sleazy-vermilion-flamingo  76942  317376  07/24/2019   0
12  764046   tacky-razzmatazz-flounder  70928  166420  08/13/2012   7
13  578179           trippy-red-collie  54373  769097  06/24/2014   5
14  849555       squeaky-asparagus-owl  71548  168128  12/28/2013   6
15  744901   whiny-vermilion-woodlouse  75309  775343  01/16/2014   5
16  490636        cozy-purple-kangaroo  64880  941951  04/03/2009  10
17  984939           messy-khaki-hound  76574  800030  06/05/2010   9
18  957801      clammy-harlequin-tapir  65677  242092  12/31/2009  10
19    8531         shabby-sapphire-tzu  29907    None  09/30/2011   8
20  906579       cranky-chestnut-okapi  30591  248430  09/26/2008  11
21  905621           zippy-ruby-coyote  68855  585220  04/29/2019   0
22  701800     bluesy-harlequin-cuscus  39153  209421  03/28/2009  10
23  947758           freaky-smalt-frog  84823  827476  04/28/2009  10
24  412606   snazzy-lemon-hippopotamus   None  848272  06/04/2013   6
25  583997     slaphappy-copper-oyster  16545  472947  04/20/2016   3
26  567923           hasty-lemon-husky  11783  440406  11/21/2008  11
27  542407           thirsty-ruby-wolf  21056  920269  12/28/2018   1
28  885265     geeky-sapphire-stingray  34473  771847  08/15/2013   6
29  896701              gamy-ivory-cow  89081  837123  10/10/2009  10

* Duplicate in latitude longitude  due to different names of the same city. Already existed in the file we used.

* Outiliers for price

In [125]:
noise_gen(speciality_df, int(speciality_df.shape[0] * 1/100), (5000, 30000), 'price')
speciality_df.head(5)

,id,name,calories,price,cuisine_name,is_vegan,is_gluten_free,is_lactose_free
0,815255,"Veal Cutlet, Milanaise",821,394,Lebanese,False,False,True
1,652943,Whipped Cream Puffs,751,484,Chinese Islamic,True,False,False
2,810891,"""Rijs Itaafel"": Rice, Curry Sauce, Lobster, Sh...",282,73,Yamal,False,False,False
3,115094,"Prime Sirloin Steak, Maison Sandwich",342,479,Maharashtrian,False,False,False
4,174951,"An Inattention on Part of Waitress, Please Rep...",920,318,Taiwanese,False,False,False

In [126]:
restaurant_df.to_excel('restaurants.xlsx')
speciality_df.to_excel('speciality.xlsx')
reviews_df.to_excel('reviews.xlsx')
coordinates_df.to_excel('coordinates.xlsx')

In [130]:
reviews_df.to_excel('reviews.xlsx')

In [135]:
coordinates_df.to_excel('coordinates.xlsx')